{
  "id": "case_045",
  "title": "Post-tonsillectomy Hemorrhage",
  "vignette": "The patient is a 10-year-old male with a history of diagnosed obstructive sleep apnea (apnea–hypopnea index [AHI] of 27) who presents to the emergency department with bleeding in the posterior oropharynx 7 days post-tonsillectomy. On physical exam, the patient is lethargic with pallor and decreased capillary refill. His vital signs are significant for tachycardia to 140 beats per minute, hypotension with blood pressure of 70/40 mmHg, and tachypnea with a respiratory rate of 25 breaths per minute. His oxygen saturation is 97%. The patient is accompanied by his mother, who states that the bleeding started 2 hours ago after the child ate a sandwich.",
  "examPhases": {
    "medicalDiseaseAndDifferential": {
      "timeAllocation": 10,
      "keyTopics": [
        "Epidemiology of tonsillectomy",
        "Differential diagnosis",
        "Vascular anatomy",
        "Risk factors and complications"
      ],
      "suggestedQuestions": [
        "What is your differential diagnosis for this patient?",
        "Describe the vascular anatomy of the tonsils and the incidence of post-tonsillectomy hemorrhage.",
        "What are the risk factors for post-tonsillectomy hemorrhage?",
        "Describe the morbidity and mortality associated with this condition."
      ]
    },
    "preop": {
      "timeAllocation": 10,
      "keyTopics": [
        "Patient assessment",
        "OR preparation",
        "Laboratory interpretation",
        "Surgical coordination"
      ],
      "suggestedQuestions": [
        "What is your approach to assessing this patient?",
        "What will you set up in the operating room for this patient?",
        "Should you plan to use vasopressors?",
        "How do you plan on interpreting this patient's laboratory results?",
        "What are your expectations of the surgeon regarding induction?"
      ]
    },
    "intraop": {
      "timeAllocation": 10,
      "keyTopics": [
        "Induction strategy",
        "Airway management",
        "Blood management",
        "Maintenance"
      ],
      "suggestedQuestions": [
        "What is your plan for induction of anesthesia?",
        "What is your plan for management of blood in the oropharynx?",
        "What is your plan for airway management?",
        "What options do you have if laryngoscopy proves challenging?",
        "What is your plan for maintenance of the anesthetic?"
      ]
    },
    "postop": {
      "timeAllocation": 5,
      "keyTopics": [
        "PICU management",
        "Transport safety",
        "Complications",
        "Discharge planning"
      ],
      "suggestedQuestions": [
        "Is postoperative management in the PICU indicated?",
        "What would you require for safe transport?",
        "Discuss potential postoperative complications.",
        "What discharge instructions should be given?"
      ]
    }
  }
}
